In [2]:
%load_ext sql

In [2]:
%sql postgresql://postgres:password@localhost:5432/sql_challenge

Traceback (most recent call last):
  File "c:\Users\x\OneDrive\Documents\Python\Mar_2023\lart_tech_etl\sql_tutorials\lib\site-packages\sql\connection.py", line 45, in __init__
    engine = sqlalchemy.create_engine(
  File "<string>", line 2, in create_engine
  File "c:\Users\x\OneDrive\Documents\Python\Mar_2023\lart_tech_etl\sql_tutorials\lib\site-packages\sqlalchemy\util\deprecations.py", line 277, in warned
    return fn(*args, **kwargs)  # type: ignore[no-any-return]
  File "c:\Users\x\OneDrive\Documents\Python\Mar_2023\lart_tech_etl\sql_tutorials\lib\site-packages\sqlalchemy\engine\create.py", line 600, in create_engine
    dbapi = dbapi_meth(**dbapi_args)
  File "c:\Users\x\OneDrive\Documents\Python\Mar_2023\lart_tech_etl\sql_tutorials\lib\site-packages\sqlalchemy\dialects\postgresql\psycopg2.py", line 667, in import_dbapi
    import psycopg2
ModuleNotFoundError: No module named 'psycopg2'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])
Traceback (most recent call last):
  File "c:\Users\x\OneDrive\Documents\Python\Mar_2023\lart_tech_etl\sql_tutorials\lib\site-packages\sql\magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
  File "c:\Users\x\OneDrive\Documents\Python\Mar_2023\lart_tech_etl\sql_tutorials\lib\site-packages\sql\connection.py", line 70, in set
    cls.current = existing or Connection(descriptor, connect_args, creator)
  File "c:\Users\x\OneDrive\Documents\Python\Mar_2023\lart_tech_etl\sql_tutorials\lib\site-packages\sql\connection.py", line 45, in __init__
    engine = sqlalchemy.create_engine(
  File "<string>", line 2, in create_engine
  File "c:\Users\x\OneDrive\Documents\Python\Mar_2023\lart_tech_etl\sql_tutorials\lib\site-packages\sqlalchemy\util\deprecations.py", line 277, in warned
    return fn(*args, **kwargs)  # type: ignore[no-any-return]
  File "c:\Users\x\OneDrive\Documents\Python\Mar_2023\lart_tech_etl\sql_tutorials\lib\site-packages\sqlalchemy\engine\create.py", line 600, in create_engine
    dbapi = dbapi_meth(**dbapi_args)
  File "c:\Users\x\OneDrive\Documents\Python\Mar_2023\lart_tech_etl\sql_tutorials\lib\site-packages\sqlalchemy\dialects\postgresql\psycopg2.py", line 667, in import_dbapi
    import psycopg2
ModuleNotFoundError: No module named 'psycopg2'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [3]:
%sql sqlite:///my_database.sqlite

In [4]:
%%sql
SELECT * FROM joined
LIMIT 5

 * sqlite:///my_database.sqlite
Done.

[('Iain', 'Dixon', 64, 'Male', 'single', 'False', '2', '56185', 0, 'Hudson PLC', 14.1, 'Volvo', 'C/V', 2012, 'SUV', 'Studio 88h Abdul park', 'South Clifford', 'G2J 0FH', 'GB15PBVM12407532454240', '4900710605483038', '978', '02/22', '05/28', '{"amount":"19262.40","time_period_years":5}'),
 ('Jayne', 'Wilson', 69, 'Female', 'divorced', 'False', '1', '36872', 0, 'Wall, Reed and Whitehouse', 10.47, 'INFINITI', 'Ram Van B350', 2012, 'Pickup', 'Flat 53i Warren parkway', 'Bernardchester', 'TD95 7FL', 'GB40VPDZ40993041315068', '2265049251106137', '463', '08/14', '01/30', '"3689.35"'),
 ('Holly', 'Pope', 55, 'Female', 'married or civil partner', 'False', '2', '93150', 0, 'Jones PLC', 19.59, 'Dodge', 'Sonoma Club Coupe Cab', 2004, 'Hatchback', '490 Spencer throughway', 'East Brianport', 'W2U 0FT', 'GB84FOIG10131295592477', '3572568216312312', '309', '09/14', '11/20', '"5285.37"'),
 ('Rebecca', 'Carter', 72, 'Female', 'married or civil partner', 'False', '3', '33947', 0, 'Jarvis and Sons', 9.84, 'Mercedes-Benz', 'Sierra 1500 Double Cab', 2014, 'SUV', 'Studio 61 Max trail', 'West Anna', 'NR5R 6JQ', 'GB38JIHO03404031405529', '4018538182792227', '344', '11/17', '11/29', '{}'),
 ('Carly', 'Nicholson', 28, 'Female', 'married or civil partner', 'False', '1', '80933', 0, 'Coleman, Daniels and Wilson', 17.92, 'Toyota', 'MDX', 1995, 'Pickup', '840 Martyn mews', 'Evanshaven', 'M6 1QS', 'GB28NKHP29146487507434', '4225781016581843257', '803', '01/15', '06/29', '{}')]

In [5]:
%%sql
SELECT vehicle_make, COUNT(*) 
FROM joined
GROUP BY vehicle_make
ORDER BY 2 DESC
Limit 10

 * sqlite:///my_database.sqlite
Done.

[('Chevrolet', 109),
 ('Ford', 75),
 ('GMC', 71),
 ('Nissan', 54),
 ('Toyota', 51),
 ('Mercedes-Benz', 46),
 ('Dodge', 41),
 ('Honda', 33),
 ('BMW', 33),
 ('Hyundai', 31)]

In [8]:
%%sql
SELECT vehicle_type, COUNT(*) 
FROM joined
GROUP BY vehicle_type
ORDER BY 2 DESC
Limit 10

 * sqlite:///my_database.sqlite
Done.

[('Sedan', 214),
 ('SUV', 212),
 ('Pickup', 163),
 ('Van/Minivan', 124),
 ('Coupe', 54),
 ('Hatchback', 50),
 ('Convertible', 27),
 ('Sedan, Wagon', 26),
 ('Coupe, Convertible', 21),
 ('Wagon', 19)]

In [ ]:
# df.to_parquet(
#    "path/to/output/file.snappy.parquet",
#    compression="snappy",
#    index=False
# )